<template>
  <div id="scroll-board">
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  name: 'ScrollBoard',
  data () {
    return {
      config: {
        header: ['时间', '养殖品种', '数量', '区块名称'],
        data: [
          ['2021-10-14 19:25:00', '青鱼', '500公斤', '区块1'],
          ['2021-10-14 12:15:00', '鲤鱼', '2400公斤', '区块2'],
          ['2021-10-14 08:23:00', '草鱼', '400公斤', '区块1'],
          ['2021-10-14 07:23:00', '鲢鱼', '200公斤', '区块1'],
          ['2021-10-14 06:12:00', '青鱼', '400公斤', '区块3'],
          ['2021-10-13 21:45:00', '鳊鱼', '200公斤', '区块1'],
          ['2021-10-13 14:25:00', '青鱼', '500公斤', '区块3'],
          ['2021-10-13 11:30:00', '草鱼', '400公斤', '区块2'],
          ['2021-10-13 08:12:00', '青鱼', '1300公斤', '区块1'],
          ['2021-10-12 07:25:00', '青鱼', '120公斤', '区块1'],
          ['2021-10-12 14:25:00', '鲤鱼', '1200公斤', '区块1'],
          ['2021-10-12 11:45:00', '青鱼', '1500公斤', '区块2'],
          ['2021-10-12 07:35:00', '鲢鱼', '2100公斤', '区块1'],
        ],
        index: true,
        columnWidth: [50, 200, 100, 100, 100],
        align: ['center'],
        rowNum: 7,
        headerBGC: '#1981f6',
        headerHeight: 45,
        oddRowBGC: 'rgba(0, 44, 81, 0.8)',
        evenRowBGC: 'rgba(10, 29, 50, 0.8)'
      }
    }
  }
}
</script>

<style lang="less">
#scroll-board {
  width: 50%;
  box-sizing: border-box;
  margin-left: 20px;
  height: 100%;
  overflow: hidden;
}
</style>
